use strict;
#use warnings;
use utf8;
use open ":utf8";
use open ":std";
use POSIX qw/ceil/;

###################
### ソードワールド

my @rating = (['3','4','5','c','15','18','24','28','37','3c',],['4','5','6','e','18','24','28','2c','3c','41',],['5','6','7','10','1b','28','37','3c','41','46',],['6','7','10','12','1e','2c','3c','41','46','5a',],['7','8','12','1e','21','30','41','46','5a','60',],['8','12','14','21','24','34','46','5a','60','66',],['9','14','16','24','34','38','4b','60','66','6c',],['a','16','18','27','38','4b','50','66','6c','85',],['b','18','27','2a','3c','50','55','6c','85','8c',],['c','1a','2a','3c','40','55','5a','72','8c','a8',],['1a','1c','2d','40','44','5a','72','78','93','b0',],['1c','2d','30','44','48','5f','78','93','9a','b8',],['1e','30','33','48','5f','64','7e','9a','a1','c0',],['20','33','48','4c','64','69','84','a1','c0','c8',],['22','36','4c','64','69','6e','8a','a8','c8','ea',],['24','39','50','69','6e','8a','90','af','d0','f3',],['26','3c','54','6e','73','90','af','d0','d8','fc',],['28','3f','58','73','90','96','b6','d8','e0','105',],['2a','42','5c','78','96','b6','bd','e0','e8','10e',],['2c','45','60','7d','9c','bd','e0','e8','10e','136',],['2e','48','64','82','a2','c4','e8','10e','136','160',],['30','4b','68','87','c4','cb','f0','117','140','16b',],['32','4e','6c','a8','cb','d2','f8','120','14a','176',],['4e','51','70','ae','d2','f8','100','129','154','181',],['51','70','91','b4','d9','100','108','132','15e','18c',],['54','74','96','ba','e0','108','132','13b','168','197',],['57','78','9b','c0','e7','132','13b','168','172','1a2',],['5a','7c','a0','e7','ee','13b','144','172','17c','1ad',],['5d','80','a5','ee','f5','144','172','17c','1ad','1b8',],['60','84','aa','f5','120','14d','17c','186','1b8','1c3',],['63','aa','af','fc','128','156','186','1b8','1c3','1ce',],['66','af','d8','103','130','15f','190','1c3','1ce','204',],['8c','b4','de','10a','138','168','1c3','1ce','1d9','210',],['90','b9','e4','111','168','171','1ce','1d9','1e4','21c',],['94','be','ea','118','171','1a4','1d9','1e4','21c','228',],['98','c3','f0','148','17a','1ae','1e4','1ef','228','263',],['9c','f0','f6','150','183','1b8','1ef','228','234','270',],['a0','f6','126','158','18c','1c2','1fa','234','270','27d',],['a4','fc','12d','160','195','1fa','205','240','27d','2bc',],['d2','102','134','168','19e','205','240','24c','28a','2ca',],['d7','108','13b','170','1d6','210','24c','258','297','2d8',],['dc','13b','142','178','1e0','21b','258','297','2a4','2e6',],['e1','142','178','180','1ea','226','264','2a4','2e6','2f4',],['e6','149','180','1b9','1f4','231','270','2b1','2f4','339',],['eb','150','188','1c2','231','23c','27c','2be','302','348',],['f0','157','190','1fe','23c','247','288','2cb','310','357',],['f5','15e','198','208','247','252','2cb','310','31e','366',],['fa','165','1a0','212','252','294','2d8','31e','32c','3b0',],['ff','16c','1a8','21c','25d','2d8','2e5','32c','33a','3c0',],['104','173','1b0','25d','268','2e5','2f2','33a','384','3d0',],['109','17a','1ef','268','273','2f2','2ff','348','3d0','3e0',],['144','1b8','1f8','273','27e','2ff','30c','356','3e0','3f0',],['14a','1c0','201','27e','2c4','30c','319','364','3f0','400',],['150','1c8','244','289','2d0','319','326','372','400','410',],['156','1d0','24e','294','2dc','326','372','3c0','410','462',],['15c','1d8','294','29f','2e8','333','380','3cf','462','473',],['162','21c','29f','2aa','2f4','340','38e','420','473','484',],['168','225','2aa','2f4','300','34d','39c','430','484','4da',],['16e','22e','2b5','300','34d','35a','3aa','440','495','4ec',],['174','276','2c0','30c','35a','367','3fc','450','4a6','4fe',],['17a','280','2cb','318','367','3b8','40b','460','4b7','558',],['180','28a','2d6','324','374','3c6','41a','4b7','510','56b',],['186','294','2e1','330','3c6','3d4','429','4c8','522','57e',],['18c','29e','2ec','33c','3d4','3e2','480','522','534','591',],['192','2a8','2f7','348','3e2','438','490','534','546','5a4',],['198','2b2','302','39b','3f0','447','4a0','546','5a4','5b7',],['19e','2bc','30d','3a8','3fe','4a0','4b0','558','5b7','618',],['1a4','2c6','318','3b5','40c','4b0','50c','56a','618','62c',],['1aa','2d0','323','3c2','465','4c0','51d','57c','62c','640',],['1b0','2da','32e','3cf','474','51d','52e','58e','640','654',],['1b6','2e4','339','3dc','483','52e','58e','5f0','654','668',],['1bc','2ee','344','436','492','53f','5a0','603','668','6cf',],['1c2','2f8','34f','444','4f0','550','5b2','616','67c','6e4',],['1c8','302','35a','452','500','561','5c4','67c','6e4','74e',],['21b','30c','365','460','510','572','629','690','6f9','764',],['222','316','370','46e','572','583','63c','6a4','70e','77a',],['229','320','37b','47c','583','5e8','64f','6b8','723','790',],['230','32a','386','48a','594','5fa','662','723','790','7ff',],['237','334','391','498','5a5','60c','6cc','738','7ff','870',],['23e','33e','39c','4a6','5b6','675','6e0','74d','816','888',],['245','348','3a7','4b4','5c7','688','74d','7bc','82d','8a0',],['24c','352','3b2','4c2','630','69b','762','7d2','844','8b8',],['253','35c','3bd','528','642','6ae','777','7e8','85b','92e',],['25a','366','420','537','654','6c1','78c','7fe','8d0','947',],['261','370','42c','546','666','730','7a1','814','8e8','960',],['268','37a','438','555','678','744','814','889','900','979',],['2c8','3de','444','564','68a','758','82a','8a0','918','9f4',],['2d0','3e9','4ac','573','69c','76c','840','8b7','992','a0e',],['2d8','3f4','4b9','582','70d','780','856','8ce','9ab','a28',],['2e0','3ff','4c6','5f0','720','794','86c','8e5','9c4','aa7',],['2e8','40a','4d3','600','733','7a8','882','960','a42','ac2',],['2f0','474','540','610','746','7bc','898','978','a5c','add',],['2f8','480','54e','620','7bc','834','8ae','990','a76','b60',],['360','48c','55c','630','76c','849','92a','9a8','a90','b7c',],['369','498','56a','6a4','77f','85e','941','9c0','aaa','c02',],['372','4a4','5dc','6b5','792','873','958','9d8','b2e','c1f',],['37b','4b0','5eb','6c6','80c','888','96f','9f0','b49','c3c',],['384','4bc','5fa','6d7','820','89d','986','a73','bd0','c59',],['38d','52e','670','6e8','834','8b2','99d','a8c','bec','c76',],['396','53b','680','762','848','8c7','9b4','aa5','c08','d02',],['39f','548','690','7de','85c','8dc','9cb','abe','c24','d90',],['3a8','555','70a','7f1','870','8f1','9e2','ad7','cb0','daf',],['3b1','5cc','71b','804','884','906','9f9','b60','ccd','dce',],['3ba','5da','72c','817','898','98a','a10','b7a','cea','e60',],['42e','5e8','73d','82a','8ac','9a0','a98','b94','d07','e80',],['438','5f6','74e','8ac','8c0','9b6','ab0','bae','d24','f15',],['442','604','75f','8c0','945','9cc','ac8','bc8','d41','f36',],['44c','612','7e0','8d4','95a','9e2','ae0','be2','dd4','f57',],['456','690','7f2','8e8','96f','9f8','af8','c72','df2','f78',],['460','69f','804','8fc','984','a83','b10','c8d','e10','1012',],['4db','6ae','816','910','999','a9a','b9f','ca8','e2e','1034',],['4e6','6bd','828','999','9ae','ab1','bb8','cc3','e4c','10d1',],['4f1','6cc','83a','9ae','a3a','ac8','bd1','cde','e6a','10f4',],['4fc','6db','8c2','9c3','a50','adf','bea','cf9','f04','1117',],['507','760','8d5','9d8','a66','af6','c03','d90','f23','113a',],['512','770','8e8','9ed','a7c','b88','c1c','dac','f42','11dc',],['594','780','8fb','a02','a92','ba0','cb2','dc8','f61','1200',],['5a0','790','90e','a92','aa8','bb8','ccc','de4','f80','12a5',],['5ac','7a0','921','aa8','b3b','bd0','ce6','e00','f9f','12ca',],['5b8','7b0','9b0','abe','b52','be8','d00','e1c','1040','12ef',],['5c4','83c','9c4','ad4','b69','c00','d1a','eba','1060','1314',],['5d0','84d','9d8','aea','b80','c99','d34','ed7','1080','13be',],['659','85e','9ec','b00','b97','cb2','dd1','ef4','10a0','13e4',],['666','86f','a00','b97','bae','ccb','dec','f11','10c0','1491',],['673','880','a14','bae','c48','ce4','e07','f2e','10e0','14b8',],['680','891','aaa','bc5','c60','cfd','e22','f4b','1188','14df',],['68d','924','abf','bdc','c78','d16','e3d','ff0','11a9','1506',],['69a','936','ad4','bf3','c90','db6','e58','100e','11ca','15b8',],['72a','948','ae9','c0a','ca8','dd0','efc','102c','11eb','15e0',],['738','95a','afe','ca8','cc0','dea','f18','104a','120c','1695',],['746','96c','b13','cc0','d61','e04','f34','1068','122d','16be',],['754','97e','bb0','cd8','d7a','e1e','f50','1086','12dc','16e7',],['762','a18','bc6','cf0','d93','e38','f6c','1132','12fe','1710',],['770','a2b','bdc','d08','dac','edf','f88','1151','1320','17ca',],['807','a3e','bf2','d20','dc5','efa','1033','1170','1342','17f4',],['816','a51','c08','dc5','dde','f15','1050','118f','1364','18b1',],['825','a64','c1e','dde','e86','f30','106d','11ae','1386','18dc',],['834','a77','cc2','df7','ea0','f4b','108a','11cd','143c','1907',],['843','b18','cd9','e10','eba','f66','10a7','1280','145f','1932',],['852','b2c','cf0','e29','ed4','1014','10c4','12a0','1482','19f4',],['8f0','b40','d07','e42','eee','1030','1176','12c0','14a5','1a20',],['900','b54','d1e','eee','f08','104c','1194','12e0','14c8','1ae5',],['910','b68','d35','f08','fb7','1068','11b2','1300','14eb','1b12',],['920','b7c','de0','f22','fd2','1084','11d0','1320','15a8','1b3f',],['930','c24','df8','f3c','fed','10a0','11ee','13da','15cc','1b6c',],['940','c39','e10','f56','1008','1155','120c','13fb','15f0','1c36',],['9e5','c4e','e28','f70','1023','1172','12c5','141c','1614','1c64',],['9f6','c63','e40','1023','103e','118f','12e4','143d','1638','1d31',],['a07','c78','e58','103e','10f4','11ac','1303','145e','165c','1d60',],['a18','c8d','f0a','1059','1110','11c9','1322','147f','1720','1d8f',],['a29','d3c','f23','1074','112c','11e6','1341','1540','1745','1dbe',],['a3a','d52','f3c','108f','1148','12a2','1360','1562','176a','1e90',],['ae6','d68','f55','10aa','1164','12c0','1420','1584','178f','1ec0',],['af8','d7e','f6e','1164','1180','12de','1440','15a6','17b4','1f95',],['b0a','d94','f87','1180','123d','12fc','1460','15c8','17d9','1fc6',],['b1c','daa','1040','119c','125a','131a','1480','15ea','18a4','1ff7',],['b2e','e60','105a','11b8','1277','1338','14a0','16b2','18ca','2028',],['b40','e77','1074','11d4','1294','13fb','14c0','16d5','18f0','2102',],['bf3','e8e','108e','11f0','12b1','141a','1587','16f8','1916','2134',],['c06','ea5','10a8','12b1','12ce','1439','15a8','171b','193c','2211',],['c19','ebc','10c2','12ce','1392','1458','15c9','173e','1962','2244',],['c2c','ed3','1182','12eb','13b0','1477','15ea','1761','1a34','2277',],['c3f','f90','119d','1308','13ce','1496','160b','1830','1a5b','22aa',],['c52','fa8','11b8','1325','13ec','1560','162c','1854','1a82','238c',],['d0c','fc0','11d3','1342','140a','1580','16fa','1878','1aa9','23c0',],['d20','fd8','11ee','140a','1428','15a0','171c','189c','1ad0','24a5',],['d34','ff0','1209','1428','14f3','15c0','173e','18c0','1af7','24da',],['d48','1008','12d0','1446','1512','15e0','1760','18e4','1bd0','250f',],['d5c','10cc','12ec','1464','1531','1600','1782','19ba','1bf8','2544',],['d70','10e5','1308','1482','1550','16d1','17a4','19df','1c20','262e',],['e31','10fe','1324','14a0','156f','16f2','1879','1a04','1c48','2664',],['e46','1117','1340','156f','158e','1713','189c','1a29','1c70','2751',],['e5b','1130','135c','158e','1660','1734','18bf','1a4e','1c98','2788',],['e70','1149','142a','15ad','1680','1755','18e2','1a73','1d78','27bf',],['e85','1214','1447','15cc','16a0','1776','1905','1b50','1da1','27f6',],['e9a','122e','1464','15eb','16c0','184e','1928','1b76','1dca','28e8',],['f62','1248','1481','160a','16e0','1870','1a04','1b9c','1df3','2920',],['f78','1262','149e','16e0','1700','1892','1a28','1bc2','1e1c','2a15',],['f8e','127c','14bb','1700','17d9','18b4','1a4c','1be8','1e45','2a4e',],['fa4','1296','1590','1720','17fa','18d6','1a70','1c0e','1f2c','2a87',],['fba','1368','15ae','1740','181b','18f8','1a94','1cf2','1f56','2ac0',],['fd0','1383','15cc','1760','183c','19d7','1ab8','1d19','1f80','2bba',],['109f','139e','15ea','1780','185d','19fa','1b9b','1d40','1faa','2bf4',],['10b6','13b9','1608','185d','187e','1a1d','1bc0','1d67','1fd4','2cf1',],['10cd','13d4','1626','187e','195e','1a40','1be5','1d8e','1ffe','2d2c',],['10e4','13ef','1702','189f','1980','1a63','1c0a','1db5','20ec','2d67',],['10fb','14c8','1721','18c0','19a2','1a86','1c2f','1ea0','2117','2da2',],['1112','14e4','1740','18e1','19c4','1b6c','1c54','1ec8','2142','2ea4',],['11e8','1500','175f','1902','19e6','1b90','1d3e','1ef0','216d','2ee0',],['1200','151c','177e','19e6','1a08','1bb4','1d64','1f18','2198','2fe5',],['1218','1538','179d','1a08','1aef','1bd8','1d8a','1f40','21c3','3022',],['1230','1554','1880','1a2a','1b12','1bfc','1db0','1f68','22b8','305f',],['1248','1634','18a0','1a4c','1b35','1c20','1dd6','205a','22e4','309c',],['1260','1651','18c0','1a6e','1b58','1d0d','1dfc','2083','2310','31a6',],['133d','166e','18e0','1a90','1b7b','1d32','1eed','20ac','233c','31e4',],['1356','168b','1900','1b7b','1b9e','1d57','1f14','20d5','2368','32f1',],['136f','16a8','1920','1b9e','1c8c','1d7c','1f3b','20fe','2394','3330',],['1388','16c5','1a0a','1bc1','1cb0','1da1','1f62','2127','2490','336f',],['13a1','17ac','1a2b','1be4','1cd4','1dc6','1f89','2220','24bd','33ae',],['13ba','17ca','1a4c','1c07','1cf8','1eba','1fb0','224a','24ea','34c0',],['13d3','17e8','1a6d','1cf8','1d1c','1ee0','1fd7','2274','2517','35d4',]);

my %unique = (
                     # 2  3  4  5  6  7  8  9 10 11 12
  'WB' => { 'num' => [ 0, 0, 0, 0, 0, 3, 3, 3, 6, 6, 6], 'name'=>'ウルフバイト',       },
  'SB' => { 'num' => [ 4, 4, 4, 4, 4, 7, 7, 7,13,13,13], 'name'=>'ソーンバッシュ',     },
  'KS' => { 'num' => [12,12,12,12,12,15,15,15,18,18,18], 'name'=>'コングスマッシュ',   },
  'BR' => { 'num' => [13,13,13,13,13,16,16,16,19,19,19], 'name'=>'ボアラッシュ',       },
  'MP' => { 'num' => [18,18,18,18,18,21,21,21,24,24,24], 'name'=>'マルサーヴラプレス', },
  'LA' => { 'num' => [18,18,18,18,18,21,21,21,36,36,36], 'name'=>'ルナアタック',       },
  'DS' => { 'num' => [24,24,24,24,24,27,27,27,30,30,30], 'name'=>'ダブルストンプ',     },
);
$unique{'ウルフバイト'}       = $unique{'WB'};
$unique{'ソーンバッシュ'}     = $unique{'SB'};
$unique{'コングスマッシュ'}   = $unique{'KS'};
$unique{'ボアラッシュ'}       = $unique{'BR'};
$unique{'マルサーヴラプレス'} = $unique{'MP'};
$unique{'ルナアタック'}       = $unique{'LA'};
$unique{'ダブルストンプ'}     = $unique{'DS'};
my $unique_reg = join('|', keys %unique);
sub rateRoll {
  my $comm = shift;
  my $needSummation = $comm =~ s/^[Σ∑]// ? 1 : 0;
  if($comm !~ /^
    (?: (?:[kr]|威力) ( [0-9]+ | \([0-9\+\-*\/()]+\) | $unique_reg ) )
    (?:\[([0-9\+\-]+)\])?
    ([0-9a-z\+\-\*\/\@\$~()><\#!PAVC値必殺首切出目難半減威力確実化聖王の冠薬師道具セット]*)
    (?:\:([0-9]+))?
    (?:\:(\S+))?
    (?:\s|$)
  /ix){
    return "";
  }
  my $rate   = $1;
  my $unique = (exists $unique{$rate}) ? $unique{$rate}{'name'} : '';
  my $crit   = $2;
  my $form   = $3;
  my $repeatCount = $4;
  my $repeatLabels = $5;
  my $rate_up;
  my $crit_atk;
  my $crit_ray;
  my $witch_blaze;
  my $fixed;
  my $powerAccurate;
  my $virtuousCrown;
  my $curse;
  my $gf;
  while($form =~ s/gf//gi)                            { $gf = ' GF'; }                      #Gフォーチュン
  while($form =~ s/(?:\@|C値)([0-9][0-9\+\-]*)//gi)   { $crit     = $1 if !$crit; }         #C値
  while($form =~ s/(?:VC|聖王(?:の冠)?)//gi)          { $virtuousCrown = 1; }               #聖王の冠
  while($form =~ s/(?:[rck]|首切)(\-?[0-9]*)//gi)     { $rate_up  = $1 ne ''?$1:5 if !$rate_up; } #首切効果
  while($form =~ s/(?:[#b!]|必殺)([\+\-]?[0-9]*)//gi) { $crit_atk = $1 ne ''?$1:1 if !$crit_atk; }#必殺効果
  while($form =~ s/薬師(?:道具(?:セット)?)?//gi)         { $fixed = 'n4'; }                    # 薬師道具セット
  while($form =~ s/(?:[\$]|出目)([nm]?[0-9]+)//gi)    { $fixed    = $1 if !$fixed; }        #出目固定
  while($form =~ s/(?:[\$]|出目)\+?([\+\-][0-9+\-()]+)//gi){ $crit_ray = $1 if !$crit_ray; }     #出目修正【クリティカルレイ】
  while($form =~ s/(?:[\$]|出目)~\+?([\+\-][0-9]+)//gi){ $witch_blaze = $1 if !$witch_blaze; } #出目修正［魔女の火］
  while($form =~ s/(?:PA|威力確実化)(\d+)?//gi)       { $powerAccurate = $1 || 4; }         #威力確実化
  while($form =~ s/(?:[<]|難)([0-9]+)//gi)            { $curse    = $1 if !$curse; }        #Aカース「難しい」
  
  $rate = $unique || calc($rate);
  $crit = calc($crit);
  if($rate > 200){ $rate = 200; } elsif($rate < 0){ $rate = 0; }
  if($crit <= 0){ $crit = 0; } elsif($crit < 3){ $crit = 3; }

  $crit_ray = calc($crit_ray) if $crit_ray;

  my @repeatCountLabels = ();
  my @repeatLabels;

  if ($repeatCount > 0) {
    @repeatLabels = ();
    $repeatCount = ($repeatCount > 50) ? 50 : (!$repeatCount) ? 1 : $repeatCount;
    for my $i (1 .. $repeatCount) {
      push(@repeatCountLabels, makeRollIndexText($i));
    }
  }

  if (($repeatLabels // '') ne '') {
    @repeatLabels = split(/\s*,\s*/, $repeatLabels);
    @repeatLabels = @repeatLabels[0 .. 49] if $#repeatLabels > 49;
  }

  my @result;
  my $count;
  my $summation = 0;
  foreach my $repeatLabel (@repeatLabels ? @repeatLabels : ('')) {
    foreach my $i (1 .. ($repeatCount || 1)){
      my $resultRow = '';

      foreach my $j (1 .. ($powerAccurate ? 2 : 1)) {
        (my $currentResultRow, my $criticalCount, my $lastNumber, my $damage) = rateCalc(
            $rate    ,
            $crit    ,
            $form    ,
            $rate_up ,
            $crit_atk,
            $crit_ray,
            $witch_blaze,
            $fixed   ,
            $curse   ,
            $virtuousCrown,
            $gf      ,
            ($repeatLabel ne '' || $repeatCount > 1) && $j == 1 ? $repeatLabel . $repeatCountLabels[$i - 1] : undef,
            ++$count
        );

        # 威力確実化
        if ($j == 1 && $powerAccurate && !$criticalCount && $lastNumber <= $powerAccurate) {
          $resultRow = "$currentResultRow | 振り直し: ";
          next;
        } else {
          $resultRow .= $currentResultRow;
          $summation += $damage;
          last;
        }
      }

      push(@result, $resultRow);
    }
  }
  my $combinedResult = join('<br>',@result);

  if ($needSummation) {
    $combinedResult .= "<br>合計： ${summation}";
  }

  return $combinedResult;
}

sub rateCalc {
  my $rate     = shift;
  my $crit     = shift; 
  my $form     = shift;
  my $rate_up  = shift;
  my $crit_atk = shift;
  my $crit_ray = shift;
  my $witch_blaze = shift;
  my $fixed    = shift;
  my $curse    = shift;
  my $virtuousCrown = shift;
  my $gf       = shift;
  my $label    = shift;
  my $repeat   = shift;
  my $unique   = (exists $unique{$rate}) ? $unique{$rate}{'name'} : '';
  
  return '' if $form =~ /[a-z]/i;
  
  my $total = 0;
  my $code = (defined($label) ? $label . ' ' : '') . ($unique || "威力${rate}");
  my @results;
  my $crits_max = 20;
  my $lastNumber;
  foreach my $crits (0 .. $crits_max) {
    my $number;
    my $inside_code;
    # 出目固定
    if($fixed){
      #片方固定
      if((my $demifixed = $fixed) =~ s/^[nm]//){
        $demifixed = ($demifixed > 6) ? 6 : ($demifixed < 1) ? 1 : $demifixed;  
        my $dice = int(rand(6)) + 1;
        $number = $dice + $demifixed;
        $inside_code = "($demifixed)+${dice}";
        #出目最低値がC値以下だと∞
        if($crit && $demifixed > 1 && $demifixed+1 >= $crit){ return ($code." C値${crit} → \[${inside_code}:クリティカル!!!\]... = ∞", undef, $number); }
        $fixed = 0 if $fixed =~ /^m/;
      }
      #両方固定
      else {
        $number = ($fixed > 12) ? 12 : ($fixed < 2) ? 2 : $fixed;
        if($number <= 2 && !$unique && !$virtuousCrown){ return ($code." → \[${number}:1ゾロ..\] = 0", 0, $number); }
        $fixed = 0; # 1回処理したらなくなる
      }
    }
    else {
      if($gf){ #GF
        my $dice = int(rand(6)) + 1;
        $number = $dice * 2;
        $inside_code = "${dice}*2";
      }
      else { #通常
        my $dice1 = int(rand(6)) + 1;
        my $dice2 = int(rand(6)) + 1;
        $number = $dice1 + $dice2;
        $inside_code = "${dice1}+${dice2}";
      }
    }
    my $number_result = $number;
    
    # 1ゾロ
    if(!$crits && $number <= 2 && !$unique && !$virtuousCrown){
      return ($code." → \[${inside_code}=${number}:1ゾロ..\] = 0", 0, $number);
      last;
    }
    $inside_code .= $inside_code ? '=' : '';
    
    # 必殺
    if($crit_atk && ($number > 2 || $unique)){
      $number += $crit_atk;
      $number = 12 if $number > 12;
      $number = 2  if $number <  2;
      $number_result .=">$number";
    }
    # クリティカルレイ
    if($crit_ray != 0 && (!defined($repeat) || $repeat == 1 || $unique)){
      $number += $crit_ray;
      $number = 12 if $number > 12;
      $number =  2 if $number <  2;
      $number_result .=">$number";
      $crit_ray = 0; # 1回処理したらなくなる
    }
    # ［魔女の火］
    if($witch_blaze != 0){
      $number += $witch_blaze if 3 <= $number && $number <= 10;
      $number = 12 if $number > 12;
      $number_result .=">$number";
      $witch_blaze = 0; # 1回処理したらなくなる
    }
    # アビスカース「難しい」
    if($curse && $number <= $curse){
      $number = 2;
      $number_result .=">×";
    }
    
    $lastNumber = $number;
    
    # 威力結果算出
    my $power;
    if($unique){
      $power = $unique{$unique}{'num'}[$number-2];
    }
    else {
      if   ($number < 3) { $power = 0; } #1ゾロ
      else { $power = ((hex($rating[$rate][$number-3]) - $number - $rate) / ($number + $rate)); } #それ以外
    }
    $total += $power;
    
    # クリティカル
    if($crit && $number >= $crit){
      push(@results, " $power\[${inside_code}${number_result}:クリティカル!\] ");
      # 首切
      if($rate_up){
        $rate += $rate_up;
        $rate = 100 if $rate > 100; #威力100以上にはしない
        $rate = 0 if $rate < 0;   #威力0未満にはしない
        $code .= ">$rate";
      }
      # 〆
      push(@results, "[クリティカル限界設定オーバーです。振り足してください]") if ($crits >= $crits_max);
      next;
    }
    
    # クリティカルしなかったので〆
    push(@results, " $power\[${inside_code}${number_result}\] ");
    last;
  }
  my $result = join('+', @results);
  my $criticalCount = $#results; # クリティカルした回数
  
  ## 修正値処理
  $form =~ s|半減|//|;
  $form =~ s/(\/\/|\*\*)([0-9]*)/<\/\/>/;
  my $half_type = $1;
  my $half_num = $2;
  my ($pre_add, $post_add) = split('<//>', $form);
  if($pre_add){
    $pre_add = parenthesisCalc($pre_add);
    if($pre_add eq ''){ return ''; }
  }
  $result .= $pre_add;
  $total += int(calc($pre_add));
  
  ## 半減,倍化処理
  if(!$half_num){ $half_num = 2 }
  if($half_type =~ /^\/\//){ $result = "{ $result = $total } /$half_num "; $total = ceil($total / $half_num); }
  elsif($half_type =~ /^\*\*/){ $result = "{ $result = $total } *$half_num "; $total = $total * $half_num; }
  ## 半減後追加
  if($post_add){
    $post_add = parenthesisCalc($post_add);
    if($post_add eq ''){ return ''; }
  }
  $result .= $post_add;
  $total += int(calc($post_add));
  
  $result .= ' = ';
  $code .= " C値${crit}" if $crit;
  return ($code . $gf. ' → '. $result . $total, $criticalCount, $lastNumber, $total);
}

sub growRoll {
  my $comm = shift;
  if($comm !~ /^
    (?: gr | 成長ダイス )
    ( [0-9] )?
    (?:\s|$)
  /ix){
    return "";
  }
  my $num = $1;
  my @grow = ('器用度','敏捷度','筋力','生命力','知力','精神力');
  
  $num = $num ? $num : 2;
  my @result;
  foreach(1 .. $num){
    push(@result, '<em class="grow-result-unit">' . $grow[int(rand(6))] . '</em>');
  }
  return join(' or ', @result);
}

sub makeRollIndexText {
  my $repeatId = shift;
  return undef unless defined($repeatId);
  my @chars = (
      '①', '②', '③', '④', '⑤', '⑥', '⑦', '⑧', '⑨', '⑩',
      '⑪', '⑫', '⑬', '⑭', '⑮', '⑯', '⑰', '⑱', '⑲', '⑳',
      '㉑', '㉒', '㉓', '㉔', '㉕', '㉖', '㉗', '㉘', '㉙', '㉚',
      '㉛', '㉜', '㉝', '㉞', '㉟', '㊱', '㊲', '㊳', '㊴', '㊵',
      '㊶', '㊷', '㊸', '㊹', '㊺', '㊻', '㊼', '㊽', '㊾', '㊿',
  );
  return $chars[$repeatId - 1];
}

sub lineAoECheck {
  my $comm = shift;

  if ($comm !~ /^(?:(\d+)|([^\s]+))?\$(?:貫通|突破)(?:<=([1-6]))?(?:\s|$)/) {
    return '';
  }

  my $times = $1 || 1;
  my @labels = ($2 // '') ne '' ? split(',', $2) : ();
  my $threshold = $3 || 3;

  $times = $#labels + 1 if $#labels >= 0;

  sub checkOnce {
    my $_threshold = shift;

    my $screenCommand = '1d';
    my $diceValue = int(rand(6)) + 1;
    my $checkResult = $diceValue <= $_threshold ? '受ける' : '受けない';
    my $checkResultClass = $checkResult eq '受ける' ? 'hit' : 'miss';
    my $thresholdText = $_threshold == 3 ? '' : "[<=${_threshold}]";

    return (
        $checkResult,
        "${screenCommand} → ${diceValue}${thresholdText} → <span class=\"${checkResultClass}\">${checkResult}</span>"
    );
  }

  my @textRows = ();
  my @hitLabels = ();
  my @missLabels = ();

  foreach (1 .. $times) {
    my $label = $labels[$_ - 1] // '';

    (my $result, my $row) = checkOnce($threshold);

    push(@hitLabels, $label) if $result eq '受ける';
    push(@missLabels, $label) if $result eq '受けない';

    if ($label eq '') {
      $label = makeRollIndexText($_) if $times > 1;
    } else {
      $label = "〚${label}〛";
    }

    $row = "${label} ${row}" if $label ne '';

    push(@textRows, $row);
  }

  my $text = join("\n", @textRows);

  if ($#labels >= 0) {
    $text .= "\n<span class=\"hit\">受ける： " . (@hitLabels ? '<span class="hit-labels">' . join(',', @hitLabels) . '</span>' : '<em>該当なし</em>') . "</span>";
    $text .= "\n<span class=\"miss\">受けない： " . (@missLabels ? join(',', @missLabels) : '<em>該当なし</em>') . "</span>";
  }

  return $text;
}

1;